#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stum0/nostr_mempool_bot/runs/run-5GUHGaT43MAdwGma

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
random_string.suffix: Refreshing state... [id=huBus05i]
module.eks.module.fargate_profile["example"].data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.eks.module.fargate_profile["example"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_default_tags.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bb8060d3b0476237]
module.eks.module.fargate_profile["example"].data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["example"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["example"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3567408449]
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/nostr-test-huBus05i/cluster]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221107132751996300000002]
module.eks.module.fargate_profile["example"].aws_iam_role.this[0]: Refreshing state... [id=example-2022110713280567750000000b]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.eks.module.fargate_profile["kube_system"].aws_iam_role.this[0]: Refreshing state... [id=kube-system-2022110713280552590000000a]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::493031039834:policy/vpc-flow-log-to-cloudwatch-20221107132751995600000001]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
module.eks.module.fargate_profile["example"].data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=nostr-test-huBus05i-cluster-20221107132751998400000003]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0bbadbdfcf236736f]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221107132751996300000002-20221107132752564200000004]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=nostr-test-huBus05i-cluster-20221107132751998400000003-20221107132752643200000006]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=nostr-test-huBus05i-cluster-20221107132751998400000003-20221107132752638100000005]
module.eks.module.fargate_profile["kube_system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=kube-system-2022110713280552590000000a-2022110713280609440000000c]
module.eks.module.fargate_profile["kube_system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=kube-system-2022110713280552590000000a-2022110713280610090000000d]
module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=example-2022110713280567750000000b-2022110713280625590000000e]
module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=example-2022110713280567750000000b-2022110713280625790000000f]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0bb8060d3b0476237]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03c0896e4f63e5333]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00ffe34fc3f07df1d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0da6dda190e9483c7]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0364f94f1c3626a34]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0baa00a44be58959b]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-066eb83cdb142abbf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bd0cc91989428ad1]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b9bde3d1237d5c99]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0340c2c5c5e35dc9c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0da6dda190e9483c71080289494]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-01c6595f15e65b0a3]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c4d8f418d78c9908]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08bce5be62271bc1f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01c74887231129f49]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e9d6c627f28aa857]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f9c10d9421431d37]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d28a8a8f067a92c9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b57558e098b4fc7a]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=nostr-test-huBus05i]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-03c0896e4f63e53331080289494]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.fargate_profile["example"].aws_eks_fargate_profile.this[0]: Refreshing state... [id=nostr-test-huBus05i:example]
module.eks.module.fargate_profile["kube_system"].aws_eks_fargate_profile.this[0]: Refreshing state... [id=nostr-test-huBus05i:kube-system]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=0fec62e3a5b6c39cf9c786f5984abfdb03f2915d]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::493031039834:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/0D642E4C545E7E5D077021B0098638F0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.module.fargate_profile["example"].aws_eks_fargate_profile.this[0] must be replaced
-/+ resource "aws_eks_fargate_profile" "this" {
      ~ arn                    = "arn:aws:eks:eu-west-2:493031039834:fargateprofile/nostr-test-huBus05i/example/c6c2292f-b29b-bf29-ed84-3e09ff8dd9b6" -> (known after apply)
      ~ fargate_profile_name   = "example" -> "nostr-project" # forces replacement
      ~ id                     = "nostr-test-huBus05i:example" -> (known after apply)
      ~ pod_execution_role_arn = "arn:aws:iam::493031039834:role/example-2022110713280567750000000b" -> (known after apply) # forces replacement
      ~ status                 = "ACTIVE" -> (known after apply)
      ~ subnet_ids             = [ # forces replacement
          + "subnet-0340c2c5c5e35dc9c",
          + "subnet-066eb83cdb142abbf",
            # (1 unchanged element hidden)
        ]
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - selector { # forces replacement
          - labels    = {
              - "Application" = "app-wildcard"
            } -> null
          - namespace = "app-*" -> null
        }
      - selector { # forces replacement
          - labels    = {
              - "Application" = "backend"
            } -> null
          - namespace = "backend" -> null
        }
      + selector { # forces replacement
          + labels    = {
              + "Application" = "nostr-bot"
            }
          + namespace = "nostr-bot"
        }

        # (1 unchanged block hidden)
    }

  # module.eks.module.fargate_profile["example"].aws_iam_role.this[0] must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::493031039834:role/example-2022110713280567750000000b" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks-fargate-pods.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-11-07T13:28:05Z" -> (known after apply)
      ~ id                    = "example-2022110713280567750000000b" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> (known after apply)
      ~ name                  = "example-2022110713280567750000000b" -> (known after apply)
      ~ name_prefix           = "example-" -> "nostr-project-" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAXFSXQUNNFNFJ6KASK" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "example-2022110713280567750000000b-2022110713280625590000000e" -> (known after apply)
      ~ role       = "example-2022110713280567750000000b" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "example-2022110713280567750000000b-2022110713280625790000000f" -> (known after apply)
      ~ role       = "example-2022110713280567750000000b" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.fargate_profile["kube_system"].aws_eks_fargate_profile.this[0] will be destroyed
  # (because module.eks.module.fargate_profile["kube_system"] is not in configuration)
  - resource "aws_eks_fargate_profile" "this" {
      - arn                    = "arn:aws:eks:eu-west-2:493031039834:fargateprofile/nostr-test-huBus05i/kube-system/12c22930-fd29-9c5f-33f0-9b9675d41312" -> null
      - cluster_name           = "nostr-test-huBus05i" -> null
      - fargate_profile_name   = "kube-system" -> null
      - id                     = "nostr-test-huBus05i:kube-system" -> null
      - pod_execution_role_arn = "arn:aws:iam::493031039834:role/kube-system-2022110713280552590000000a" -> null
      - status                 = "ACTIVE" -> null
      - subnet_ids             = [
          - "subnet-0340c2c5c5e35dc9c",
          - "subnet-066eb83cdb142abbf",
          - "subnet-0b9bde3d1237d5c99",
        ] -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null

      - selector {
          - labels    = {} -> null
          - namespace = "kube-system" -> null
        }

      - timeouts {}
    }

  # module.eks.module.fargate_profile["kube_system"].aws_iam_role.this[0] will be destroyed
  # (because module.eks.module.fargate_profile["kube_system"] is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::493031039834:role/kube-system-2022110713280552590000000a" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks-fargate-pods.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-07T13:28:05Z" -> null
      - description           = "Fargate profile IAM role" -> null
      - force_detach_policies = true -> null
      - id                    = "kube-system-2022110713280552590000000a" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "kube-system-2022110713280552590000000a" -> null
      - name_prefix           = "kube-system-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXFSXQUNNGKK7Z74MR" -> null

      - inline_policy {}
    }

  # module.eks.module.fargate_profile["kube_system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be destroyed
  # (because module.eks.module.fargate_profile["kube_system"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "kube-system-2022110713280552590000000a-2022110713280610090000000d" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy" -> null
      - role       = "kube-system-2022110713280552590000000a" -> null
    }

  # module.eks.module.fargate_profile["kube_system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be destroyed
  # (because module.eks.module.fargate_profile["kube_system"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "kube-system-2022110713280552590000000a-2022110713280609440000000c" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "kube-system-2022110713280552590000000a" -> null
    }

Plan: 4 to add, 0 to change, 8 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-5GUHGaT43MAdwGma/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-5GUHGaT43MAdwGma/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @stum0, Action: `pull_request`*